Tekla.Structures.Drawing.GraphicObject
The GraphicObject class is the abstract base class for all graphic objects
(the arc, the circle, the cloud, the line, the polygon, the polyline and the rectangle).